{
  "title": "2020年の振り返り",
  "html": "<p>社の営業日も終わったし、毎年恒例の振り返りをやっていき。</p><p>なんだか今年は特に早かった気がするわ・・。<br />\n<br />\n</p>\n\n<div class=\"section\">\n    <h3>＼ 🐣 ／</h3>\n    <p>6月に子（かわいい）が生まれた。</p><p>そしたらまぁ本当に、生活が一変した。他の人の話とかはもちろん聞いてたけど、そらそうなるわな〜って感じ。<br />\nいわゆる可処分時間が消滅して、あらゆる優先順位が変わったと感じる。</p><p>自分だけの時間として確保できるのは、平日の仕事中+寝る前の2時間くらい。<br />\nと割り切ったほうがいろいろ幸せになれるし、奥さんはもっと時間ないはずなので按分せねばならぬ。</p><p>コードの読み書き以外にもやりたいこと（楽器とかゲームとか読書とか）はあるので、その配分を精査した結果、やらなくなった・できなくなったこともいろいろあって。</p><p>とにかく、「目の前にあるコレは、この貴重な時間を割いてまでやるべきことか？」って、より深く考えるようになった。<br />\n今までも「これ無駄やな〜興味なし」って見切りをつける判断が速い自負はあったけど、それがさらに加速したと思う。</p><p>情報の取捨選択が素早くできるようになった反面、相対的なインプット量は減ったな〜とは感じていて、そことどう向き合っていくかが、エンジニアとしては今後の課題かも。</p><p>既に仕事に直接的に結びつかないものに対する食指が動かないようになってることには気付いてて、どうしたもんかな〜ってなってる今日このごろ。</p>\n\n</div>\n<div class=\"section\">\n    <h3>転職（出戻り）した</h3>\n    <p>もうひとつのトピックは、一度は辞めたピクセルグリッド社に出戻りしたこと。</p><p>社での暮らしは本当に平和です、凪。<br />\nもちろん受託なので案件によってはペースを乱されることはあるけど、基本的には自分にできることしかこない。</p><p>それに加えて最近は、手を動かすよりも頭を動かす役回りも多くて、そういうもんなのかね〜人生〜ってなってる。</p><p>転職時の懸念であったトキメキ不足は未だ解決してなくて、はやく何か見つけたいなーとは思ってるけど、まぁその分だけ子（父親似らしい）とも戯れられるので、今はまぁよいかなという感じ。</p>\n\n    <blockquote>\n        <p>実はエンジニア35才定年説って、35くらいになるとだいたいの人は家庭ができるので、老いとは関係なくブイブイする余裕がなくなるってだけでは・・？</p>\n\n    </blockquote>\n<p>そういや転職直後は副業も探してて、あの頃はWebRTCマンへの需要がすごく高かったのを思い出した。</p><p>リモート需要もあってか5社くらいからお問い合わせをいただいたり、転職したって書いてるのにスカウト的な話も数件いただいたり、実は希少な人材なのか？！って勘違いしそうになってた。</p>\n\n</div>\n<div class=\"section\">\n    <h3>2020年やってたこと</h3>\n    <p>さて、ここから技術ブログっぽい振り返り。</p><p>この1年でやってたことを思い出しながら、ざっくりまとめて書いていく。</p>\n\n<div class=\"section\">\n    <h4>WebRTC</h4>\n    <p>転職するまでずっとやってたこと。</p><p>OSSのSFU実装の`mediasoup`を使い込んでたのもこの頃で、GitHubに置いてるデモのコードとかは、今でもちょいちょい見られてる感じがある。<br />\n`mediasoup`のリポジトリを久々に見てみたけど、当時からはそんなに機能追加もされてなくて、山を超えたのだなあと思った。</p><p>今はまったくやってないし、あんなに読んでたSpecもRFCも読んでない。<br />\nWebTransportもQUICも、いざ仕事でやらなくなったらまったく追わなくなった。</p><p>でも一時とはいえ、低レイヤーなプロトコルに触れられたのは良かったと思う。</p>\n\n</div>\n<div class=\"section\">\n    <h4>Rust / WASM</h4>\n    <p>フロントエンド寄りの内容で、Rust x WASMでのユースケースを模索したり。</p><p>2019の`#AdventOfCode`をやれるくらいには、Rustの文法もマスターしてた気がする。<br />\nそしてそのあとJSの言語機能の少なさに発狂してた気もする。</p><p>ただWASMの広いスコープの中でも、ブラウザで動かす用途にフォーカスしちゃうと、今できることってそんなにないよな〜というのが結論だった。（単に視野と想像力が足りなくて、即実的なものしか見てないという説はある）</p><p>単に筋トレ的な意味で使うこともできるけど、それをやる優先度はあまり高くないので、どんどん忘れてってる。</p>\n\n</div>\n<div class=\"section\">\n    <h4>Jamstack</h4>\n    <p>転職してからやってること。<br />\n正確には、社が推してるのであれこれ調べてみて、詳しくなったこと。</p>\n\n    <blockquote>\n        <p><a href=\"https://lealog.hateblo.jp/entry/2020/09/30/163242\">Modern Web Development on the JAMstack &#x3092;&#x8AAD;&#x3093;&#x3067;&#x307E;&#x3068;&#x3081;&#x305F; - console.lealog();</a></p>\n\n    </blockquote>\n<p>構成要素に目新しいものはなく、実態はただのテクニック集です。<br />\n個人的には、Pros/Consがちゃんとあって、一概に推せるもんではないなーという見解。</p><p>その構成が真のJamstackたるためには、いろんな条件があるけど（上記事を参照）、シンプルに作ろうという流れには大賛成なので、まぁ美味しいところだけ取り入れるでええんちゃいますか？って感じ。原理主義者ではないので適当。</p><p>ただしそこを見極めず、愚直にやろうとすると、局所的に複雑さが貯まってしまったり、建前を通すために運用フローがないがしろにされたり、いろんな歪みが生まれてしまうなーとは思ってる。結局のところ、道具の良し悪しを決めるのは我々とその使い方なので。</p><p>あと、運用フェーズに重きをおいたスタックなので、受託の会社でやるにはちゃんと線引が必要だということもわかった。だって各種サービスの運用とかホスティングとかログ監視とかしたくないし。</p><p>もう少し概念が世に浸透してからのほうが、社としてもやりやすいのかなーとなんとなく思ってる。</p>\n\n</div>\n<div class=\"section\">\n    <h4>Frontend</h4>\n    <p>結局、仕事でいちばんよくやってるのは、あいも変わらずこのあたり。</p><p>ここで振り返りとしてあえて書いておくなら、「Reactってむずかしくない？なんでこんな流行ってんの？」というお気持ち。</p><p>今まで何度も案件で採用してきたし、会社のメディアでPreactについての連載を書いてみたりもした結果、今こう思ってる。</p><p>難しいものを作るためのものなので当然ではあるけど、やればやるほど難しい（Easyではない）技術だということがわかってきてて、よくもまあこんな難しいもん使ってるな・・って最近は思う。（思ってたよりも、相当難しいものを作るためのものだったという意）</p><p>コンポーネント指向を一般化したReactは偉いと思うけど、それ自体は今も昔もエッジな技術思想を掲げてると思ってて、選ばれしエンジニアしか扱えないものなのでは？と。</p><p>職業がら他人が書いたコードもよく見てきてるけど、Hooksを適切に（少なくとも自分の理解通りに）扱えてる人柱は本当に少ない印象。そしてよくわかってない人によって生み出された巨Hooksのコードは、まじで読めたもんじゃない。React関係ない部分ももちろんあるけど、より顕著になるイメージというか。</p><p>\"フレームワーク使われ\"な人が何を使おうと大差ないんやとは思うけど、それでも世の「とりえあずReactで」感が薄まって、トンデモコードをなんとかする仕事が減ればいいなと思ってます。</p><p>そういう気持ちが高まった頃に、「Write less code」を掲げるSvelteに出会い、そうそう君たちにはこれくらいで良いんや・・ってなったのが今年のハイライト。</p><p>「jQueryしか触ったことないです・・」みたいな人は、Reactを触るより先に、SvelteとかVueとか扱いやすいのを経て、Reactの頂にたどり着いたらいいと思います。いわゆるデキるエンジニャーはReactを推してくるかもしれんけど、ちゃんと自分の頭で考えて、自分の作ろうとしてるものに最適な道具を選んだほうがいいと思うな〜知らんけど。</p><p>まあ実際、フレームワークの使い方に奮闘するより、それ以前のそもそものプログラミングのところをがんばったほうが、ほとんどの職業エンジニアは幸せになれるとも思うけど・・。</p>\n\n</div>\n<div class=\"section\">\n    <h4>その他</h4>\n    <p>転職の合間にLeetCodeをやってた。<br />\nデータ構造やアルゴリズムを学ぶのは嫌いじゃないし興味はあるけど、趣味にしたいほどハマりはしなかった。</p><p>こういう系のプログラミングは、仕事のUIプログラミングとは必要な筋肉が違うなーと思ってしまって、今の状態だとそこまで傾倒できないなと。やらないよりやってるほうがいいと思うけど。</p><p>AdventOfCodeは年末の風物詩として毎年やってるので、あれをもう少し楽に解けるようにはなりたいかもしれない・・ｗ<br />\n（今年は時間がなくてPart.1しかやってないけど、それでもいくつかわからないのがあった）</p><p>コロナの影響で、勉強会に行かなかったし、オンライン登壇も1回しかしなかった。<br />\nやっぱ勉強会は現地の雰囲気が欲しいな〜って思うけど、世の状況は好転する兆しがな・・・。</p><p>あとオンラインになった途端、開催時間が謎に遅くなるのやめてほしいです！（30代・子持ちより）</p><p>OSS活動は息を吸うようにやれるようになってて、いちいち覚えてない。</p>\n\n</div>\n</div>\n<div class=\"section\">\n    <h3>2021年は</h3>\n    <p>「来年はこれをやろう！」というのが特に見つけられてなくて、どうしよっかな〜ってなってる。</p><p>とりあえず冬休みは達人プログラマーの第2版を読んで、読み終わったらまた新たなネタを探したいところ。</p><p>それではよいお年を！</p>\n\n</div>"
}
