{
  "title": "初めてウェブサービスをリリースしたので",
  "html": "<p>こういうの書いてみたかったんですよね。</p><p>少し前からアクセスできるようにしてましたが、一応今日がリリース日なので。<br />\n肝心のサービスはこちらです。</p>\n\n    <blockquote>\n        <p><a href=\"http://msctwts.fndr.info/\">Music Tweets Finder | More tweets, more musics.</a></p>\n\n    </blockquote>\n<p>バンド名やアーティスト名を入力すると、それを検索してくれるウェブサービスです。<br />\n返ってくる結果は、#nowplayingであったりYouTubeのリンクであったり、音楽に特化したもののみにしてます。</p><p>Twitterユーザーで、なおかつ音楽好きな人にはそこそこ受けると信じてます。<br />\n登録も何もいらないので、ぜひ使ってみてください。</p><p>サービス紹介動画とかもありますよ！</p><p>というわけで本編へ。<br />\n大したことしてないので、技術的にどうだとかはさておき。<br />\n構築以外のところで、どういうことをしてたかを書いておきます。</p>\n\n<div class=\"seemore\">\n    \n<div class=\"section\">\n    <h3>とにかく、ネタを考えた</h3>\n    <p>一日一個、どんなもんでもいいので考えるようにしました。<br />\nやっぱおもしろいもの、今までにないものを作りたいですもん。<br />\nもちろん実際にすでにあるアイデアも山のように出ますが、このプロセスがきっと！今後の糧に！（なったらいいな</p>\n\n</div>\n<div class=\"section\">\n    <h3>考えたアイデアの概要を文章でまとめる</h3>\n    <p>思いついたら、サービス化を考えて、概要を文章にしてみます。<br />\nアイデアから企画に落とす作業です。<br />\nEvernoteでサービス単位でメモしてもいいですけど、細かくなりすぎるのであれば、まとめて「アイデア集」にしちゃっても良いと思います。<br />\n私はそうやってます。</p><p>ここで大して文字数を稼げないのであれば、それは本当にシンプルなサービスか、ただの思いつきかどっちかです。</p>\n\n</div>\n<div class=\"section\">\n    <h3>自分に足りない部分を把握する</h3>\n    <p>これが重要。<br />\n作りたいものが決まったら、ほんとに作れるかどうかを見極めます。</p><p>アイデアがあってもスキルがないという典型な私。<br />\nいったいどれほどのアイデアがお蔵入りになったことか。<br />\nただ、できないと感じたので即諦める！ではなく、ちょっと検索してみると良いと思います。<br />\n意外に簡単にできたりとか、タナボタ的なものがあります。</p>\n\n</div>\n<div class=\"section\">\n    <h3>検索力をみがく</h3>\n    <p>便利な世の中で、たいていのことは検索すればわかります。<br />\nそれの真偽はさておき、だいたいわかります。</p><p>壁にぶち当たったとき、何が問題かを理解して、「もしかして・・？」と検索すれば、だいたいどうにかなります。<br />\n諦めたらそこで試合終了です。</p>\n\n</div>\n<div class=\"section\">\n    <h3>プログラミングは想像力</h3>\n    <p>本当に基礎から学んだ人は、こんな苦労はしないんでしょうけど・・。<br />\nわからないことがあった時、コードを睨んで悩み続けるより、「こういう仕組みなら、ここはこうなるはず」みたいな視点を持つことで、わかったりすることもありました。<br />\nしょせんコードはルールに従ってきっちり組み立てられたパスルなので、「多分そうなってるんじゃない？」は、そうなってます。<br />\nそういうもんだと悟りましたｗ</p>\n\n</div>\n<div class=\"section\">\n    <h3>書くべし！書くべし！</h3>\n    <p>あとはコードを書きます。</p><p>やればできると思ってやったら、意外にできちゃったというわけで。</p>\n\n</div>\n</div>"
}
